app/views/partials/_capsule.html.erb

SELECT `offers`.* FROM `offers` WHERE `offers`.`product_id` = 4 AND (ip = '172.18.100.97' and token ='Ez21xbyE8JFiqzzGyIr4zhewIGzRKzXM2gvIfNGHlFw=' and response = 'counter') ORDER BY `offers`.`id` DESC LIMIT 1
---
<% offer_token = (session[:_csrf_token] ||= ActiveSupport::SecureRandom.base64(32)) %>
<% @last_offer = product.offers.last(:conditions => ["ip = ? and token = ?", request.remote_ip, offer_token]) %>