app/controllers/home_controller.rb

SELECT COUNT(*) FROM `products` WHERE `products`.`user_id` = 1
SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 1 ORDER BY `products`.`id` DESC LIMIT 1
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
---
  def index
    if params[:signed_request]
      begin
        signed_request = parse_signed_request(params, oauth_secret("facebook"))
        if signed_request["user_id"]
          session[:signed_request] = params[:signed_request]
        else
          redirect_to :action => "callback"
        end
      rescue => e
        # render :text => e.message.inspect and return false
        redirect_to :action => "callback" and return
      end
    else
      flash.discard
      if logged_in?
        if current_user.profile.nil?
          render :template => "users/profile"
        elsif current_user.products.empty?

SELECT SUM(products.regular_price-price) as total FROM `offers` INNER JOIN products ON offers.product_id=products.id and products.user_id = 1 and response LIKE 'paid' and Date(offers.updated_at) = '2012-06-26' LIMIT 1
---
  def analytics
    @today = Date.today-1.day
    if request.post?
      @page = params[:page].to_i
    else
      @page = 1
    end
    @size = 5
    @per_page = 1
    @post_pages = (@size.to_f/@per_page).ceil;
    @page =1 if @page.to_i<=0 or @page.to_i > @post_pages
    @titleX = "Time Period"
    @titleY = "#"
    @colors = ["blue"]
    @i = 0
    @head_line = ""

    case @page
      when @i+=1
        @head_line = "Look at your cool analytics!"
        @title = "# Of Visits"
        @offers_a = Offer.first(:select => "SUM(counter) as total", :joins => "INNER JOIN products ON offers.product_id=products.id and products.user_id = #{current_user.id} and response NOT LIKE 'expired'")

SELECT COUNT(*) FROM `products` WHERE (product_type = '1')
SELECT `products`.* FROM `products` WHERE (product_type = '1') LIMIT 0,1
---
  def say_your_price
    if logged_in?
      redirect_to root_path
      return
    end
    if request.post?
      @page = params[:page].to_i
    else
      @page = 1
    end
    @type = params[:type]
    @size = (@type ? Product.by_product_type(@type).count.to_i : Product.count.to_i)

SELECT `payments`.* FROM `payments` INNER JOIN offers ON payments.offer_id=offers.id ORDER BY id desc LIMIT 100
---
  def winners
    @payments = Payment.all(:order => "id desc", :joins => "INNER JOIN offers ON payments.offer_id=offers.id", :limit => 100)