app/controllers/products_controller.rb

  def create
    if request.post?
      @product = current_user.products.new(params[:product])
      if @product.valid? and @product.errors.empty?
        @product.quantity = params[:product][:quantity].gsub(/\D+/, "") if params[:product][:quantity]
        @product.regular_price = params[:product][:regular_price].gsub(/\D+/, "")
        @product.target_price = params[:product][:target_price].gsub(/\D+/, "")
        if @product.save
---
INSERT INTO `products` (`author`, `back_image_content_type`, `back_image_file_name`, `back_image_file_size`, `back_image_updated_at`, `created_at`, `description`, `front_image_content_type`, `front_image_file_name`, `front_image_file_size`, `front_image_updated_at`, `is_live`, `name`, `product_type`, `quantity`, `regular_price`, `target_price`, `updated_at`, `user_id`) VALUES ('Barnes & Noble', 'image/jpeg', '141583242.JPG', 9268, '2012-06-27 09:15:17', '2012-06-27 09:15:17', 'Easiest to use with the world’s best reading screen & longest battery life\r\nNEW! Best–Text™, ultra-crisp, reads just like paper – even in bright sun\r\nNEW! Longest battery life – read for over 2 months based on a half hour of daily reading1\r\nOver 2.5 million books, get them in seconds w/ built-in Wi-Fi®\r\nNo annoying ads\r\nAlways free NOOK support in-store\r\nBorrow books from your public library', 'image/gif', '155956115.GIF', 87295, '2012-06-27 09:15:17', 1, 'NOOK Simple Touch™', 1, NULL, 99.0, 70.0, '2012-06-27 09:15:17', 1)

  def payments
    if request.post?
      if params[:email]
        @payment = Payment.find(params[:id])
        @email = params[:email]
        if check_emails(@email)
          NotifyMailer.sendcoupon(@email, @payment).deliver
          flash[:notice] = "Thank you for playing! You will get your voucher soon!"
          redirect_to root_path
          return
        else
          flash[:error]= "Hi, please enter a valid email address"
          render :template => "/products/success"
          return
        end
      else
        @offer = Offer.find_by_id(params[:id].to_i)
---
SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 1 LIMIT 1
SELECT `offers`.* FROM `offers` WHERE `offers`.`id` = 22 LIMIT 1

            success,msg = @payment.purchase(@payment.price)
            if success
              @payment.cc_number = @payment.cc_number + 42891
              payment_found = Payment.find_by_offer_id(@offer.id)
              if payment_found
                @payment = payment_found
              else
                @payment.save
---
SELECT `payments`.* FROM `payments` WHERE `payments`.`offer_id` = 22 LIMIT 1
INSERT INTO `payments` (`cc_expiry_m`, `cc_expiry_y`, `cc_number`, `cc_type`, `city`, `country`, `created_at`, `email`, `first_name`, `last_name`, `offer_id`, `phone`, `postal_code`, `price`, `quantity`, `state`, `street1`, `street2`, `transaction_id`, `updated_at`) VALUES (5, 2017, 4847844789729844, 'Visa', 'Mountain View', 'USA', '2012-06-27 11:40:14', 'brijeshshaha86@gmail.com', 'Brijesh', 'Shah', 22, 8980203844, '94041', 118.0, NULL, 'CA', '82 Pioneer Way', NULL, '5FA95488826517735', '2012-06-27 11:40:14')

                end
                # NotifyMailer.payment_mail_to_merchant(recipients, @payment).deliver
                # NotifyMailer.payment_mail_to_consumer(admins, @payment).deliver
                @payment.offer.update_attribute(:response, "paid")
---
UPDATE `offers` SET `response` = 'paid', `updated_at` = '2012-06-27 11:40:14' WHERE `offers`.`id` = 22

  def download_pdf
    if params[:id]
      @payment = Payment.find_by_id(params[:id])
---
SELECT `payments`.* FROM `payments` WHERE `payments`.`id` = 1 LIMIT 1

  def show
    if params[:id]
      @product = Product.find_by_id(params[:id])
      if @product.nil?
        redirect_to root_path
        return
      end
      offer_token = (session[:_csrf_token] ||= SecureRandom.base64(32))

      @last_offer = @product.offers.last(:conditions => ["ip = ? and token = ?", request.remote_ip, offer_token])
      if request.post?
        if @last_offer and @last_offer.accepted?
          return
        end
        if params[:submit_button]
          submit = params[:submit_button].strip.downcase
          if ["yes", "no"].include? submit
            if submit == "no"
              @last_offer.update_attribute(:response, "rejected")
              flash[:error] = "Sorry we can't make a deal right now. Try again later?"
            elsif submit == "yes"
              @last_offer.update_attribute(:response, "accepted")
              flash[:notice] = (@last_offer.price == 0) ? "Cool! Congrats! you won free Dealkat khakis. Share with facebook /twitter friends!" : "Cool! You snagged a deal!"
            end
            for offer in @product.offers.all(:conditions => ["ip = ? and token = ? and id < ? and (response IS NULL OR response LIKE 'counter')", request.remote_ip, offer_token, @last_offer.id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT `offers`.* FROM `offers` WHERE `offers`.`product_id` = 4 AND (ip = '172.18.100.97' and token ='Ez21xbyE8JFiqzzGyIr4zhewIGzRKzXM2gvIfNGHlFw=' and response = 'counter') ORDER BY `offers`.`id` DESC LIMIT 1
UPDATE `offers` SET response='expired' WHERE `offers`.`product_id` = 1 AND (ip = '127.0.0.1' and token = 'yQkvD921RcVneOjAsTDBq0fZ7j2Crx2ZHsQ3XgOWPMc=' and id <= 2 and (response IS NULL OR response LIKE 'counter'))
SELECT `offers`.* FROM `offers` WHERE `offers`.`product_id` = 4 AND (ip = '172.18.100.97' and token = 'Ez21xbyE8JFiqzzGyIr4zhewIGzRKzXM2gvIfNGHlFw=' and id <= 1 and (response IS NULL OR response LIKE 'counter'))

              end
          else
              @offer = Offer.new(:ip => request.remote_ip, :token => offer_token, :product_id => @product.id, :price => price, :counter => 1)
              @offer.save
---
INSERT INTO `offers` (`counter`, `created_at`, `ip`, `price`, `product_id`, `response`, `token`, `updated_at`) VALUES (1, '2012-06-26 10:42:09', '127.0.0.1', 90.0, 1, NULL, 'yQkvD921RcVneOjAsTDBq0fZ7j2Crx2ZHsQ3XgOWPMc=', '2012-06-26 10:42:09')