app/controllers/users_controller.rb

UPDATE `users` SET `is_blocked` = 0, `updated_at` = '2012-06-26 07:54:35' WHERE `users`.`id` = 1
SELECT `users`.* FROM `users` WHERE (email = 'biz@dealkat.com' and password='princessthecat') LIMIT 1
SELECT 1 AS one FROM `users` WHERE `users`.`email` = 'biz@dealkat.com' LIMIT 1
INSERT INTO `users` (`created_at`, `email`, `is_blocked`, `password`, `remember_token`, `remember_token_epires_at`, `updated_at`) VALUES ('2012-06-26 07:44:28', 'biz@dealkat.com', NULL, 'princessthecat', NULL, NULL, '2012-06-26 07:44:28')
---
  def biz
    if logged_in?
      redirect_to root_path
      return
    end
    if params[:user]
      logout_keeping_session!
      @user = User.authenticate(params[:user][:email], params[:user][:password])
      if @user
        @user.update_attribute(:is_blocked, false)
        session[@user.email] = nil

        self.current_user = @user
        # new_cookie_flag = (params[:remember_me] == "1")
        # handle_remember_cookie! new_cookie_flag
        redirect_back_or_default('/')
        flash[:notice] = nil
      else
        @new_user = User.find_by_email(params[:user][:email])
        if @new_user
          flash[:error] = "Please enter valid information"
        else
          @user = User.new(params[:user])
          if @user.email.blank? || @user.password.blank? || !check_emails(params[:user][:email])
            flash.now[:error] = "Wrong Username/Email and password combination."
          end

          success = @user && @user.valid?
          if success && @user.errors.empty?
            @user.save

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'undefined' LIMIT 1
---
  def forgot
    flash.discard
    if request.post?
      email = params[:email]
      if email.strip.blank?
        flash[:error] = "Please enter valid information"
        redirect_to :back
      else
        @user = User.find_by_email(email)

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
INSERT INTO `profiles` (`address`, `created_at`, `facebook_url`, `header_color`, `logo_content_type`, `logo_file_name`, `logo_file_size`, `logo_updated_at`, `name`, `phone`, `twitter`, `updated_at`, `user_id`, `website`) VALUES ('82 Pioneer way, Suite 109', '2012-06-26 07:59:50', 'http://www.facebook.com/dealkat', '415F9B', 'image/jpeg', 'mylogo.jpg', 1056, '2012-06-26 07:59:50', 'Dealkat', 4153233506, 'dealkat', '2012-06-26 07:59:50', 1, 'http://www.dealkat.com')
---
  def profile
    @profile = current_user.profile if current_user.profile
    if request.post?
      @profile = (current_user.profile || Profile.new(params[:profile]))
      @profile.attributes = params[:profile]
      if @profile.errors.empty? and @profile.valid?
        # header color: 415F9B
        @profile.user = current_user
        @profile.save