app/views/products/new.html.erb

SELECT COUNT(*) FROM `products` WHERE `products`.`user_id` = 1
---
<%= render :partial => "/partials/my_dashboard" if current_user.products.count > 0 %>